#+OPTIONS: toc:nil
** インクリメント
   1+ 1-という記法がある. また incf, decf という関数もある.
   - [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Arithmetic-Operations.html][Arithmetic Operations - GNU Emacs Lisp Reference Manual]]

#+begin_src emacs-lisp
(setq test-value 0)
(setq test-value (+ test-value 1))
(setq test-value (1+ test-value))
(incf test-value)

(setq test-value (1- test-value))
(decf test-value)
#+end_src

#+RESULTS:
: 1

